cmsis-svd/cmsis-svd-data/data/Atmel/ATSAMD10D13AM.svd
        <register>
          <name>ACTIVE</name>
          <description>Active Channel and Levels</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LVLEX0</name>
              <description>Level 0 Channel Trigger Request Executing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX1</name>
              <description>Level 1 Channel Trigger Request Executing</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX2</name>
              <description>Level 2 Channel Trigger Request Executing</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX3</name>
              <description>Level 3 Channel Trigger Request Executing</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID</name>
              <description>Active Channel ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABUSY</name>
              <description>Active Channel Busy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCNT</name>
              <description>Active Channel Block Transfer Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEADDR</name>
          <description>Descriptor Memory Section Base Address</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>Descriptor Memory Base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRBADDR</name>
          <description>Write-Back Memory Section Base Address</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRBADDR</name>
              <description>Write-Back Memory Base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHID</name>
          <description>Channel ID</description>
          <addressOffset>0x3F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ID</name>
              <description>Channel ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHCTRLA</name>
          <description>Channel Control A</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Channel Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Channel Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHCTRLB</name>
          <description>Channel Control B</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVACT</name>
              <description>Event Input Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACTSelect</name>
                <enumeratedValue>
                  <name>NOACT</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG</name>
                  <description>Transfer and periodic transfer trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRIG</name>
                  <description>Conditional transfer trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBLOCK</name>
                  <description>Conditional block transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>Channel suspend operation</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>Channel resume operation</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSKIP</name>
                  <description>Skip next block suspend action</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVIE</name>
              <description>Channel Event Input Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVOE</name>
              <description>Channel Event Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVL</name>
              <description>Channel Arbitration Level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>LVLSelect</name>
                <enumeratedValue>
                  <name>LVL0</name>
                  <description>Channel Priority Level 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL1</name>
                  <description>Channel Priority Level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL2</name>
                  <description>Channel Priority Level 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL3</name>
                  <description>Channel Priority Level 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGSRC</name>
              <description>Trigger Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>TRIGSRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Only software/event triggers</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGACT</name>
              <description>Trigger Action</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TRIGACTSelect</name>
                <enumeratedValue>
                  <name>BLOCK</name>
                  <description>One trigger required for each block transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEAT</name>
                  <description>One trigger required for each beat transfer</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSACTION</name>
                  <description>One trigger required for each transaction</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD</name>
              <description>Software Command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NOACT</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>Channel suspend operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>Channel resume operation</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHINTENCLR</name>
          <description>Channel Interrupt Enable Clear</description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Channel Transfer Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Channel Transfer Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHINTENSET</name>
          <description>Channel Interrupt Enable Set</description>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Channel Transfer Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Channel Transfer Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHINTFLAG</name>
          <description>Channel Interrupt Flag Status and Clear</description>
          <addressOffset>0x4E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Channel Transfer Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Channel Transfer Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSTATUS</name>
          <description>Channel Status</description>
          <addressOffset>0x4F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PEND</name>
              <description>Channel Pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Channel Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Channel Fetch Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
